src/Catalogs/Переименования/Переименования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Переименования</name>
  <attributes>
    <name>action_date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>old_secid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>new_secid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Переименования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура ЗагрузитьС_MOEXНаСервере(Параметры, АдресРезультата) Экспорт
	URL = "https://iss.moex.com/iss/history/engines/stock/markets/shares/securities/changeover.json?iss.meta=off&iss.json=extended";

	ДопПараметры = КлиентHTTPКлиентСервер.НовыеДополнительныеПараметры();
	//@skip-check bsl-legacy-check-returning-type-for-environment
	Ответ = КлиентHTTPКлиентСервер.ТелоОтветаКакJSON(ДопПараметры).Получить(URL, , ДопПараметры);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						        	НСтр("ru='Ошибка получения данных с биржи. Код ответа <%1>'"),
						        	Ответ.КодСостояния);
		ОбщегоНазначения.СообщитьПользователю(ТекстПредупреждения);		
		Возврат;		
	КонецЕсли;
	
	ТелоОтвета = Ответ.Тело[1];
	
	Если ТелоОтвета.changeover.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Ошибка получения данных с биржи. Список не загружен.'"));		
		Возврат;		
	КонецЕсли;
	
	БондОбщий.ОчиститьСправочник(Справочники.Переименования);
	ВсегоЗаписей = ТелоОтвета.changeover.Количество();
	ТекущаяЗапись = 1;	

	Для Каждого эл Из ТелоОтвета.changeover Цикл
		ПереименованияОбъект = СоздатьЭлемент();
		ПереименованияОбъект.action_date = ПрочитатьДатуJSON(эл.action_date, ФорматДатыJSON.ISO); 
		ПереименованияОбъект.old_secid = эл.old_secid;
		ПереименованияОбъект.new_secid = эл.new_secid; 
		ПереименованияОбъект.Наименование = ПереименованияОбъект.old_secid + " --> " + ПереименованияОбъект.new_secid;
		ПереименованияОбъект.Записать();
		
		ПроцентВыполнения = Окр((ТекущаяЗапись/ВсегоЗаписей)*100, 0);

		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, ПереименованияОбъект.Наименование);
		ТекущаяЗапись = ТекущаяЗапись + 1;		
	КонецЦикла;
	СтрРезультат = СтрШаблон(НСтр("ru='Загружено %1 записей'"), ВсегоЗаписей);
	ПоместитьВоВременноеХранилище(СтрРезультат, АдресРезультата);
КонецПроцедуры
#КонецОбласти

//@skip-check module-region-empty
#Область ОбработчикиСобытий
#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#КонецЕсли
